Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano/Firmware/src/packs/PIC32CM6408PL10048_DFP/component/osc32kctrl.h
#define OSC32KCTRL_XOSC32KCTRL_ENABLE_Pos     _UINT32_(1)                                          /* (OSC32KCTRL_XOSC32KCTRL) Oscillator Enable Position */
#define OSC32KCTRL_XOSC32KCTRL_ENABLE_Msk     (_UINT32_(0x1) << OSC32KCTRL_XOSC32KCTRL_ENABLE_Pos) /* (OSC32KCTRL_XOSC32KCTRL) Oscillator Enable Mask */
#define OSC32KCTRL_XOSC32KCTRL_ENABLE(value)  (OSC32KCTRL_XOSC32KCTRL_ENABLE_Msk & (_UINT32_(value) << OSC32KCTRL_XOSC32KCTRL_ENABLE_Pos)) /* Assignment of value for ENABLE in the OSC32KCTRL_XOSC32KCTRL register */
#define OSC32KCTRL_XOSC32KCTRL_XTALEN_Pos     _UINT32_(2)                                          /* (OSC32KCTRL_XOSC32KCTRL) External Source Select Position */
#define OSC32KCTRL_XOSC32KCTRL_XTALEN_Msk     (_UINT32_(0x1) << OSC32KCTRL_XOSC32KCTRL_XTALEN_Pos) /* (OSC32KCTRL_XOSC32KCTRL) External Source Select Mask */
#define OSC32KCTRL_XOSC32KCTRL_XTALEN(value)  (OSC32KCTRL_XOSC32KCTRL_XTALEN_Msk & (_UINT32_(value) << OSC32KCTRL_XOSC32KCTRL_XTALEN_Pos)) /* Assignment of value for XTALEN in the OSC32KCTRL_XOSC32KCTRL register */
#define   OSC32KCTRL_XOSC32KCTRL_XTALEN_EXTCLK_Val _UINT32_(0x0)                                        /* (OSC32KCTRL_XOSC32KCTRL) External Clock on the XTAL32K1 pin. XTAL32K2 is available for other functions. The CSUT timer is disregarded, and no start-up time is used.  */
#define   OSC32KCTRL_XOSC32KCTRL_XTALEN_XTAL_Val _UINT32_(0x1)                                        /* (OSC32KCTRL_XOSC32KCTRL) External Crystal connected to the XTAL32K1 and XTAL32K2 pins  */
#define OSC32KCTRL_XOSC32KCTRL_XTALEN_EXTCLK  (OSC32KCTRL_XOSC32KCTRL_XTALEN_EXTCLK_Val << OSC32KCTRL_XOSC32KCTRL_XTALEN_Pos) /* (OSC32KCTRL_XOSC32KCTRL) External Clock on the XTAL32K1 pin. XTAL32K2 is available for other functions. The CSUT timer is disregarded, and no start-up time is used. Position */
#define OSC32KCTRL_XOSC32KCTRL_XTALEN_XTAL    (OSC32KCTRL_XOSC32KCTRL_XTALEN_XTAL_Val << OSC32KCTRL_XOSC32KCTRL_XTALEN_Pos) /* (OSC32KCTRL_XOSC32KCTRL) External Crystal connected to the XTAL32K1 and XTAL32K2 pins Position */
#define OSC32KCTRL_XOSC32KCTRL_ONDEMAND_Pos   _UINT32_(7)                                          /* (OSC32KCTRL_XOSC32KCTRL) On-Demand Operation Position */
#define OSC32KCTRL_XOSC32KCTRL_ONDEMAND_Msk   (_UINT32_(0x1) << OSC32KCTRL_XOSC32KCTRL_ONDEMAND_Pos) /* (OSC32KCTRL_XOSC32KCTRL) On-Demand Operation Mask */
#define OSC32KCTRL_XOSC32KCTRL_ONDEMAND(value) (OSC32KCTRL_XOSC32KCTRL_ONDEMAND_Msk & (_UINT32_(value) << OSC32KCTRL_XOSC32KCTRL_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the OSC32KCTRL_XOSC32KCTRL register */
#define OSC32KCTRL_XOSC32KCTRL_CSUT_Pos       _UINT32_(8)                                          /* (OSC32KCTRL_XOSC32KCTRL) Crystal Oscillator Start-Up Time Position */
#define OSC32KCTRL_XOSC32KCTRL_CSUT_Msk       (_UINT32_(0x3) << OSC32KCTRL_XOSC32KCTRL_CSUT_Pos)   /* (OSC32KCTRL_XOSC32KCTRL) Crystal Oscillator Start-Up Time Mask */
#define OSC32KCTRL_XOSC32KCTRL_CSUT(value)    (OSC32KCTRL_XOSC32KCTRL_CSUT_Msk & (_UINT32_(value) << OSC32KCTRL_XOSC32KCTRL_CSUT_Pos)) /* Assignment of value for CSUT in the OSC32KCTRL_XOSC32KCTRL register */
#define   OSC32KCTRL_XOSC32KCTRL_CSUT_1K_Val  _UINT32_(0x0)                                        /* (OSC32KCTRL_XOSC32KCTRL) 1K XOSC32K cycles  */
#define   OSC32KCTRL_XOSC32KCTRL_CSUT_16K_Val _UINT32_(0x1)                                        /* (OSC32KCTRL_XOSC32KCTRL) 16K XOSC32K cycles  */
#define   OSC32KCTRL_XOSC32KCTRL_CSUT_32K_Val _UINT32_(0x2)                                        /* (OSC32KCTRL_XOSC32KCTRL) 32K XOSC32K cycles  */
#define   OSC32KCTRL_XOSC32KCTRL_CSUT_64K_Val _UINT32_(0x3)                                        /* (OSC32KCTRL_XOSC32KCTRL) 64K XOSC32K cycles  */
#define OSC32KCTRL_XOSC32KCTRL_CSUT_1K        (OSC32KCTRL_XOSC32KCTRL_CSUT_1K_Val << OSC32KCTRL_XOSC32KCTRL_CSUT_Pos) /* (OSC32KCTRL_XOSC32KCTRL) 1K XOSC32K cycles Position */
#define OSC32KCTRL_XOSC32KCTRL_CSUT_16K       (OSC32KCTRL_XOSC32KCTRL_CSUT_16K_Val << OSC32KCTRL_XOSC32KCTRL_CSUT_Pos) /* (OSC32KCTRL_XOSC32KCTRL) 16K XOSC32K cycles Position */
#define OSC32KCTRL_XOSC32KCTRL_CSUT_32K       (OSC32KCTRL_XOSC32KCTRL_CSUT_32K_Val << OSC32KCTRL_XOSC32KCTRL_CSUT_Pos) /* (OSC32KCTRL_XOSC32KCTRL) 32K XOSC32K cycles Position */
#define OSC32KCTRL_XOSC32KCTRL_CSUT_64K       (OSC32KCTRL_XOSC32KCTRL_CSUT_64K_Val << OSC32KCTRL_XOSC32KCTRL_CSUT_Pos) /* (OSC32KCTRL_XOSC32KCTRL) 64K XOSC32K cycles Position */
#define OSC32KCTRL_XOSC32KCTRL_LPMODE_Pos     _UINT32_(13)                                         /* (OSC32KCTRL_XOSC32KCTRL) Low Power Mode Position */
#define OSC32KCTRL_XOSC32KCTRL_LPMODE_Msk     (_UINT32_(0x1) << OSC32KCTRL_XOSC32KCTRL_LPMODE_Pos) /* (OSC32KCTRL_XOSC32KCTRL) Low Power Mode Mask */
#define OSC32KCTRL_XOSC32KCTRL_LPMODE(value)  (OSC32KCTRL_XOSC32KCTRL_LPMODE_Msk & (_UINT32_(value) << OSC32KCTRL_XOSC32KCTRL_LPMODE_Pos)) /* Assignment of value for LPMODE in the OSC32KCTRL_XOSC32KCTRL register */
#define OSC32KCTRL_XOSC32KCTRL_WRTLOCK_Pos    _UINT32_(31)                                         /* (OSC32KCTRL_XOSC32KCTRL) Write Lock Position */
#define OSC32KCTRL_XOSC32KCTRL_WRTLOCK_Msk    (_UINT32_(0x1) << OSC32KCTRL_XOSC32KCTRL_WRTLOCK_Pos) /* (OSC32KCTRL_XOSC32KCTRL) Write Lock Mask */
#define OSC32KCTRL_XOSC32KCTRL_WRTLOCK(value) (OSC32KCTRL_XOSC32KCTRL_WRTLOCK_Msk & (_UINT32_(value) << OSC32KCTRL_XOSC32KCTRL_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the OSC32KCTRL_XOSC32KCTRL register */
#define OSC32KCTRL_XOSC32KCTRL_Msk            _UINT32_(0x80002386)                                 /* (OSC32KCTRL_XOSC32KCTRL) Register Mask  */


/* -------- OSC32KCTRL_CFDCTRL : (OSC32KCTRL Offset: 0x20) (R/W 32) Clock Failure Detector Control -------- */
#define OSC32KCTRL_CFDCTRL_RESETVALUE         _UINT32_(0x00)                                       /*  (OSC32KCTRL_CFDCTRL) Clock Failure Detector Control  Reset Value */

#define OSC32KCTRL_CFDCTRL_CFDEN_Pos          _UINT32_(0)                                          /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Enable Position */
#define OSC32KCTRL_CFDCTRL_CFDEN_Msk          (_UINT32_(0x1) << OSC32KCTRL_CFDCTRL_CFDEN_Pos)      /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Enable Mask */
#define OSC32KCTRL_CFDCTRL_CFDEN(value)       (OSC32KCTRL_CFDCTRL_CFDEN_Msk & (_UINT32_(value) << OSC32KCTRL_CFDCTRL_CFDEN_Pos)) /* Assignment of value for CFDEN in the OSC32KCTRL_CFDCTRL register */
#define OSC32KCTRL_CFDCTRL_SWBACK_Pos         _UINT32_(1)                                          /* (OSC32KCTRL_CFDCTRL) Clock Switch Back Enable Position */
#define OSC32KCTRL_CFDCTRL_SWBACK_Msk         (_UINT32_(0x1) << OSC32KCTRL_CFDCTRL_SWBACK_Pos)     /* (OSC32KCTRL_CFDCTRL) Clock Switch Back Enable Mask */
#define OSC32KCTRL_CFDCTRL_SWBACK(value)      (OSC32KCTRL_CFDCTRL_SWBACK_Msk & (_UINT32_(value) << OSC32KCTRL_CFDCTRL_SWBACK_Pos)) /* Assignment of value for SWBACK in the OSC32KCTRL_CFDCTRL register */
#define OSC32KCTRL_CFDCTRL_CFDPRESC_Pos       _UINT32_(2)                                          /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Prescaler Position */
#define OSC32KCTRL_CFDCTRL_CFDPRESC_Msk       (_UINT32_(0x1) << OSC32KCTRL_CFDCTRL_CFDPRESC_Pos)   /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Prescaler Mask */
#define OSC32KCTRL_CFDCTRL_CFDPRESC(value)    (OSC32KCTRL_CFDCTRL_CFDPRESC_Msk & (_UINT32_(value) << OSC32KCTRL_CFDCTRL_CFDPRESC_Pos)) /* Assignment of value for CFDPRESC in the OSC32KCTRL_CFDCTRL register */
#define OSC32KCTRL_CFDCTRL_Msk                _UINT32_(0x00000007)                                 /* (OSC32KCTRL_CFDCTRL) Register Mask  */


/* -------- OSC32KCTRL_EVCTRL : (OSC32KCTRL Offset: 0x24) (R/W 32) Event Control -------- */
#define OSC32KCTRL_EVCTRL_RESETVALUE          _UINT32_(0x00)                                       /*  (OSC32KCTRL_EVCTRL) Event Control  Reset Value */

#define OSC32KCTRL_EVCTRL_CFDEO_Pos           _UINT32_(0)                                          /* (OSC32KCTRL_EVCTRL) Clock Failure Detector Event Output Enable Position */
#define OSC32KCTRL_EVCTRL_CFDEO_Msk           (_UINT32_(0x1) << OSC32KCTRL_EVCTRL_CFDEO_Pos)       /* (OSC32KCTRL_EVCTRL) Clock Failure Detector Event Output Enable Mask */
#define OSC32KCTRL_EVCTRL_CFDEO(value)        (OSC32KCTRL_EVCTRL_CFDEO_Msk & (_UINT32_(value) << OSC32KCTRL_EVCTRL_CFDEO_Pos)) /* Assignment of value for CFDEO in the OSC32KCTRL_EVCTRL register */
#define OSC32KCTRL_EVCTRL_Msk                 _UINT32_(0x00000001)                                 /* (OSC32KCTRL_EVCTRL) Register Mask  */


