Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano/Firmware/src/packs/PIC32CM6408PL10048_DFP/component/osc32kctrl.h
/* -------- OSC32KCTRL_OSC32KCTRL : (OSC32KCTRL Offset: 0x28) (R/W 32) 32.768 kHz Internal Oscillator (OSC32K) Control -------- */
#define OSC32KCTRL_OSC32KCTRL_RESETVALUE      _UINT32_(0x80)                                       /*  (OSC32KCTRL_OSC32KCTRL) 32.768 kHz Internal Oscillator (OSC32K) Control  Reset Value */

#define OSC32KCTRL_OSC32KCTRL_ONDEMAND_Pos    _UINT32_(7)                                          /* (OSC32KCTRL_OSC32KCTRL) On-Demand Operation Position */
#define OSC32KCTRL_OSC32KCTRL_ONDEMAND_Msk    (_UINT32_(0x1) << OSC32KCTRL_OSC32KCTRL_ONDEMAND_Pos) /* (OSC32KCTRL_OSC32KCTRL) On-Demand Operation Mask */
#define OSC32KCTRL_OSC32KCTRL_ONDEMAND(value) (OSC32KCTRL_OSC32KCTRL_ONDEMAND_Msk & (_UINT32_(value) << OSC32KCTRL_OSC32KCTRL_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the OSC32KCTRL_OSC32KCTRL register */
#define OSC32KCTRL_OSC32KCTRL_WRTLOCK_Pos     _UINT32_(31)                                         /* (OSC32KCTRL_OSC32KCTRL) Write Lock Position */
#define OSC32KCTRL_OSC32KCTRL_WRTLOCK_Msk     (_UINT32_(0x1) << OSC32KCTRL_OSC32KCTRL_WRTLOCK_Pos) /* (OSC32KCTRL_OSC32KCTRL) Write Lock Mask */
#define OSC32KCTRL_OSC32KCTRL_WRTLOCK(value)  (OSC32KCTRL_OSC32KCTRL_WRTLOCK_Msk & (_UINT32_(value) << OSC32KCTRL_OSC32KCTRL_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the OSC32KCTRL_OSC32KCTRL register */
#define OSC32KCTRL_OSC32KCTRL_Msk             _UINT32_(0x80000080)                                 /* (OSC32KCTRL_OSC32KCTRL) Register Mask  */


/* -------- OSC32KCTRL_WPCTRL : (OSC32KCTRL Offset: 0x2C) (R/W 32) Write Protection Control -------- */
#define OSC32KCTRL_WPCTRL_RESETVALUE          _UINT32_(0x00)                                       /*  (OSC32KCTRL_WPCTRL) Write Protection Control  Reset Value */

#define OSC32KCTRL_WPCTRL_WPEN_Pos            _UINT32_(0)                                          /* (OSC32KCTRL_WPCTRL) Write Protection Enable Position */
#define OSC32KCTRL_WPCTRL_WPEN_Msk            (_UINT32_(0x1) << OSC32KCTRL_WPCTRL_WPEN_Pos)        /* (OSC32KCTRL_WPCTRL) Write Protection Enable Mask */
#define OSC32KCTRL_WPCTRL_WPEN(value)         (OSC32KCTRL_WPCTRL_WPEN_Msk & (_UINT32_(value) << OSC32KCTRL_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the OSC32KCTRL_WPCTRL register */
#define OSC32KCTRL_WPCTRL_WPLCK_Pos           _UINT32_(1)                                          /* (OSC32KCTRL_WPCTRL) Write Protection Lock Position */
#define OSC32KCTRL_WPCTRL_WPLCK_Msk           (_UINT32_(0x1) << OSC32KCTRL_WPCTRL_WPLCK_Pos)       /* (OSC32KCTRL_WPCTRL) Write Protection Lock Mask */
#define OSC32KCTRL_WPCTRL_WPLCK(value)        (OSC32KCTRL_WPCTRL_WPLCK_Msk & (_UINT32_(value) << OSC32KCTRL_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the OSC32KCTRL_WPCTRL register */
#define OSC32KCTRL_WPCTRL_WPKEY_Pos           _UINT32_(8)                                          /* (OSC32KCTRL_WPCTRL) Write Protection Key Position */
#define OSC32KCTRL_WPCTRL_WPKEY_Msk           (_UINT32_(0xFFFFFF) << OSC32KCTRL_WPCTRL_WPKEY_Pos)  /* (OSC32KCTRL_WPCTRL) Write Protection Key Mask */
#define OSC32KCTRL_WPCTRL_WPKEY(value)        (OSC32KCTRL_WPCTRL_WPKEY_Msk & (_UINT32_(value) << OSC32KCTRL_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the OSC32KCTRL_WPCTRL register */
#define   OSC32KCTRL_WPCTRL_WPKEY_KEY_Val     _UINT32_(0x4F5343)                                   /* (OSC32KCTRL_WPCTRL) Allow writes to the WPCTRL register  */
#define OSC32KCTRL_WPCTRL_WPKEY_KEY           (OSC32KCTRL_WPCTRL_WPKEY_KEY_Val << OSC32KCTRL_WPCTRL_WPKEY_Pos) /* (OSC32KCTRL_WPCTRL) Allow writes to the WPCTRL register Position */
#define OSC32KCTRL_WPCTRL_Msk                 _UINT32_(0xFFFFFF03)                                 /* (OSC32KCTRL_WPCTRL) Register Mask  */


/* OSC32KCTRL register offsets definitions */
#define OSC32KCTRL_INTENCLR_REG_OFST   _UINT32_(0x04)      /* (OSC32KCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define OSC32KCTRL_INTENSET_REG_OFST   _UINT32_(0x08)      /* (OSC32KCTRL_INTENSET) Interrupt Enable Set Offset */
#define OSC32KCTRL_INTFLAG_REG_OFST    _UINT32_(0x0C)      /* (OSC32KCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define OSC32KCTRL_INTFLAGSET_REG_OFST _UINT32_(0x10)      /* (OSC32KCTRL_INTFLAGSET) Interrupt Flag Software Set Offset */
#define OSC32KCTRL_STATUS_REG_OFST     _UINT32_(0x14)      /* (OSC32KCTRL_STATUS) Status Offset */
#define OSC32KCTRL_RTCCTRL_REG_OFST    _UINT32_(0x18)      /* (OSC32KCTRL_RTCCTRL) RTC Control Offset */
#define OSC32KCTRL_XOSC32KCTRL_REG_OFST _UINT32_(0x1C)      /* (OSC32KCTRL_XOSC32KCTRL) XOSC32K Control Offset */
#define OSC32KCTRL_CFDCTRL_REG_OFST    _UINT32_(0x20)      /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Control Offset */
#define OSC32KCTRL_EVCTRL_REG_OFST     _UINT32_(0x24)      /* (OSC32KCTRL_EVCTRL) Event Control Offset */
#define OSC32KCTRL_OSC32KCTRL_REG_OFST _UINT32_(0x28)      /* (OSC32KCTRL_OSC32KCTRL) 32.768 kHz Internal Oscillator (OSC32K) Control Offset */
#define OSC32KCTRL_WPCTRL_REG_OFST     _UINT32_(0x2C)      /* (OSC32KCTRL_WPCTRL) Write Protection Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* OSC32KCTRL register API structure */
typedef struct
{  /* 32.768 kHz Oscillators Controller */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       OSC32KCTRL_INTENCLR; /* Offset: 0x04 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       OSC32KCTRL_INTENSET; /* Offset: 0x08 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       OSC32KCTRL_INTFLAG; /* Offset: 0x0C (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint32_t                       OSC32KCTRL_INTFLAGSET; /* Offset: 0x10 (R/W  32) Interrupt Flag Software Set */
  __I   uint32_t                       OSC32KCTRL_STATUS;  /* Offset: 0x14 (R/   32) Status */
  __IO  uint32_t                       OSC32KCTRL_RTCCTRL; /* Offset: 0x18 (R/W  32) RTC Control */
  __IO  uint32_t                       OSC32KCTRL_XOSC32KCTRL; /* Offset: 0x1C (R/W  32) XOSC32K Control */
  __IO  uint32_t                       OSC32KCTRL_CFDCTRL; /* Offset: 0x20 (R/W  32) Clock Failure Detector Control */
  __IO  uint32_t                       OSC32KCTRL_EVCTRL;  /* Offset: 0x24 (R/W  32) Event Control */
  __IO  uint32_t                       OSC32KCTRL_OSC32KCTRL; /* Offset: 0x28 (R/W  32) 32.768 kHz Internal Oscillator (OSC32K) Control */
  __IO  uint32_t                       OSC32KCTRL_WPCTRL;  /* Offset: 0x2C (R/W  32) Write Protection Control */
} osc32kctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_OSC32KCTRL_COMPONENT_H_ */
